import { Container, Typography } from '@material-ui/core';
import React from 'react';

import CommonFade from '../../components/common/CommonFade';

export const ServiceConditions = (): JSX.Element => (
  <CommonFade>
    <Container>
      <Typography variant="body1">
        <Typography variant="h6">Гарантийное обязательство</Typography>
        <p>
          Гарантийное обязательство распространяется на мягкую мебель,
          изготовленную на предприятии ООО ПЭП «Полидрев».
        </p>
        <p>
          Бесплатное обслуживание (ремонт мебели) предоставляется в течение
          гарантийного срока эксплуатации мебели при соблюдении условий
          транспортирования, эксплуатации и рекомендаций по уходу за мебелью.
        </p>
        <p>
          Гарантийный срок эксплуатации мягкой мебели составляет 18 месяцев и
          исчисляется со дня продажи, а при ее отсутствии документов об оплате –
          от даты выпуска (указывается на этикетке). Срок эксплуатации - 2 года.
        </p>
        <p>
          Основанием для гарантийного обслуживания является заполненный
          гарантийный талон на мягкую мебель с проставленной датой продажи либо
          датой выпуска изделия. Гарантийный талон передается покупателю и
          должен храниться в течение гарантийного срока эксплуатации.
        </p>
        <p>
          Бесплатный гарантийный ремонт распространяется на дефекты мебели,
          возникшие по вине предприятия-изготовителя.
        </p>
        <Typography variant="h6">Порядок предъявления претензии </Typography>
        <p>
          Бесплатное и платное сервисное обслуживание осуществляется по
          заявлению покупателя, поданному в отдел доставки и гарантийного
          обслуживания, с помощью услуг почтовой связи или с помощью формы
          обратной связи на сайте.
        </p>
        <p>
          Срок ремонта и удовлетворение требований покупателя соответствует
          сроку, определенному в «Законе о защите прав потребителя» либо
          соглашением сторон. Ремонт производится на дому или на предприятии, в
          зависимости от характера дефекта.
        </p>
        <p>
          Претензии по внешнему виду изделия, некомплекту, несоответствию заказа
          принимаются только непосредственно при получении изделия. В дальнейшем
          такие претензии не принимаются, все работы осуществляются за счет
          покупателя.
        </p>
        <p>
          В случае приобретения уцененной мебели претензии по качеству и
          внешнему виду не принимаются.
        </p>
        <Typography variant="h6">
          Бесплатный гарантийный ремонт не производится:
        </Typography>
        <ul>
          <li>По истечению гарантийного срока. </li>
          <li>
            В случае нарушения правил эксплуатации мебели, правил ухода за
            обивочной тканью или кожей, указанных в гарантийном талоне.
          </li>
          <li>
            Не допускается использовать подлокотники и спинку в собранном виде
            для сиденья и прочих физических упражнений.
          </li>
          <li>
            Если изделие имеет следы постороннего вмешательства или ремонта.
          </li>
          <li>
            При обнаружении несанкционированных изменений в конструкции изделия.
          </li>
          <li>
            При преднамеренном повреждении, неправильной эксплуатации,
            повреждении мебели домашними животными, повреждении повышенной
            температурой (утюг и др.) и огнем, превышении допустимых нагрузок на
            механизмы трансформации.
          </li>
          <li>
            При отсутствии заполненного гарантийного талона или документов,
            подтверждающих факт покупки.
          </li>
        </ul>
        <Typography variant="h6">
          Обмен и возврат приобретенных товаров
        </Typography>
        <p>
          Согласно статьи 28 Закона Республики Беларусь от 9 января 2002 г.
          №90-З «О защите прав потребителей» потребитель вправе в течение
          четырнадцати дней с момента передачи ему непродовольственного товара,
          если более длительный срок не объявлен продавцом, в месте приобретения
          или иных местах, объявленных продавцом, возвратить товар надлежащего
          качества или обменять его на аналогичный товар других размера, формы,
          габарита, фасона, расцветки или комплектации, произведя в случае
          разницы в цене необходимый перерасчет с продавцом.
        </p>
        <p>
          Требование потребителя об обмене либо возврате товара подлежит
          удовлетворению, если товар не был в употреблении, сохранены его
          потребительские свойства и имеются доказательства приобретения его у
          данного продавца.
        </p>
        <p>
          Перечень непродовольственных товаров надлежащего качества, не
          подлежащих обмену и возврату, утверждается Правительством Республики
          Беларусь. Постановлением Совета Министров Республики Беларусь от
          14.06.2002 №778 утвержден перечень непродовольственных товаров
          надлежащего качества, не подлежащих обмену и возврату, согласно
          которому не подлежат обмену и возврату только мебельные гарнитуры и
          наборы.
        </p>
        <p>
          Набор мебели - это группа изделий, связанных между собой общей
          архитектурно-художественной задачей обстановки помещений, с широкой
          вариабельностью по составу и назначению. Из изделий одного набора
          можно образовывать различные варианты комплектов мебели, например,
          набор для кухни, спальни, детской комнаты.
        </p>
        <p>
          Гарнитур мебели - группа изделий, связанных между собой по
          архитектурно-художественному и конструктивному признакам,
          предназначенных для обстановки определенной функциональной зоны
          помещения (например: гарнитур мягкой мебели из дивана и кресел;
          гарнитур для столовой, включающий шкаф для посуды, стол обеденный и
          стулья; кухонный гарнитур, объединяющий шкафы-столы, шкафы для посуды
          и продуктов напольные и настенные, шкафы под мойку).
        </p>
      </Typography>
    </Container>
  </CommonFade>
);
